Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Loads the bundle’s executable code and returns any errors.
ja: バンドルの持つ実行可能コードをロードして何らかのエラーを返します。

source: Local Network Services
ja: ローカルネットワーサービス

source: Local to the current machine—the place to install items available to everyone on this machine.
ja: 現在のマシンにローカル — このマシン上の誰にでも利用可能な項目をインストールする場所。

source: Localization
ja: ローカライゼーション

source: Locates and optionally creates the specified common directory in a domain.
ja: ある領域において、指定される一般的ディレクトリの位置を突き止めて、任意に作成します。

source: Locates and returns the address of the implementation of the instance method identified by a given selector.
ja: 指定されたセレクタによって識別されるインスタンスメソッドの実装の所在（アドレス）を突き止めて返します。

source: Locates and returns the address of the receiver’s implementation of a method so it can be called as a function.
ja: あるメソッドのこのレシーバの持つ実装の所在（アドレス）を突き止めて返します、それでそれは関数として呼び出し可能です。

source: Locating Application Group Container Directories
ja: アプリケーショングループコンテナディレクトリの位置決めをする

source: Locating Resources in a Bundle
ja: バンドル内のリソースを捜し出す

source: Locating System Directories
ja: システムディレクトリの位置を突き止める

source: Locating a single resource in a bundle
ja: バンドル内のただ１つのリソースを捜し出す

source: Location of Input Methods (Library/Input Methods)
ja: インプットメソッドの場所（Library/Input Methods）

source: Location of application support files (Library/Application Support).
ja: アプリケーションサポートファイルの場所（Library/Application Support）。

source: Location of core services (System/Library/Core Services).
ja: コアサービスの場所（System/Library/Core Services）。

source: Location of discardable cache files (Library/Caches).
ja: 処分可能なキャッシュファイルの場所（Library/Caches）。

source: Location of system's PPDs directory (Library/Printers/PPDs)
ja: ユーザのPPDディレクトリの場所（Library/Printers/PPDs）

source: Location of the PreferencePanes directory for use with System Preferences (Library/Preference Panes)
ja: システム環境設定で使うためのPreferencePanesディレクトリの場所（Library/Preference Panes）

source: Location of the trash directory.
ja: ゴミ箱ディレクトリの場所。

source: Location of the user scripts folder for the calling application (~/Library/Application Scripts/<code-signing-id>
ja: アプリケーションを呼び出すためのユーザスクリプトフォルダの場所（~/Library/Application Scripts/<code-signing-id>

source: Location of the user’s downloads directory.
ja: ユーザのダウンロードディレクトリの場所。

source: Location of user's Movies directory (~/Movies)
ja: ユーザのMoviesディレクトリの場所(~/Movies）

source: Location of user's Music directory (~/Music)
ja: ユーザのMusicディレクトリの場所（~/Music）

source: Location of user's Pictures directory (~/Pictures)
ja: ユーザのPicturesディレクトリの場所（~/Pictures）

source: Location of user's Public sharing directory (~/Public)
ja: ユーザのPublic共有ディレクトリの場所（~/Public）

source: Location of user’s autosaved documents Library/Autosave Information
ja: ユーザの自動保存書類の場所Library/Autosave Information

source: Location of user’s desktop directory.
ja: ユーザのデスクトップディレクトリの場所。

source: Logs a given exception by calling NSLog().
ja: 与えられた例外をNSLog()を呼ぶことによってログします。

source: Logs an error message to the Apple System Log facility (see man 3 asl).
ja: エラーメッセージを「Appleシステムログ」機能に記録します（man 3 aslを見てください）。

source: Logs an error message to the Apple System Log facility.
ja: エラーメッセージを「Appleシステムログ」機能に記録します。

source: Look-ahead assertion.
ja: 前方指定。

source: Look-behind assertion.
ja: 後方指定。

source: Low-Level Utilities
ja: ローレベルユーティリティ

source: Make your data types encodable and decodable for compatibility with external representations such as JSON.
ja: あなたのデータ型のエンコーディングとデコーディングを外部表現、例えばJSONなどとの互換性のために行います。

source: Makes a newly allocated Core Foundation object eligible for collection.
ja: コレクションにふさわしい、新しくアロケートされたCore Foundationオブジェクトを作ります。

source: Manage files and key-value data that are automatically synchronized among a user's iCloud devices.
ja: ユーザ所有のiCloudデバイス間で自動的に同期するファイルやキー値データを管理します。

source: Manage secure interprocess communication.
ja: 安全なプロセス間通信を管理します。

source: Manage the interaction between an app extension and its hosting app.
ja: アプリ拡張とそれの提供側アプリとの間の相互作用を管理します。

source: Manage your app's interaction with the host operating system and other processes, and implement low-level concurrency features.
ja: あなたのアプリとオペレーティングシステムおよび他のプロセスとの相互作用を管理します、そしてローレベル同期機能を実装します。

source: Manage your app's work and its interaction with the user and the system.
ja: あなたのアプリの仕事とそれのユーザおよびシステムとの相互作用を管理します。

source: Managed File Access
ja: ファイルアクセスを管理する

source: Managing AM and PM Symbols
ja: AM および PM シンボルを管理する

source: Managing Attributes
ja: 属性を管理する

source: Managing Behavior Version
ja: 挙動バージョンを管理する

source: Managing Era Symbols
ja: 紀元シンボルを管理する

source: Managing Formats and Styles
ja: 書式設定とスタイルを管理する

source: Managing Month Symbols
ja: 月シンボルを管理する

source: Managing Natural Language Support
ja: 自然言語サポートを管理する

source: Managing Observers
ja: オブザーバを管理する

source: Managing Points
ja: ポイントの管理

source: Managing Preservation Priority for On Demand Resources
ja: 「オンデマンドリソース」に対する維持優先度を管理する

source: Managing Quarter Symbols
ja: 四半期シンボルを管理する

source: Managing Ranges
ja: 範囲を管理する

source: Managing Rectangles
ja: 矩形を管理する

source: Managing Sizes
ja: サイズを管理する

source: Managing Weekday Symbols
ja: 曜日シンボルを管理する

source: Managing iCloud-Based Items
ja: iCloud基盤の項目を管理する

source: Managing the Blocks in the Operation
ja: 演算中のブロックを管理する

source: Managing the Current Directory
ja: 現在のディレクトリを管理する

source: Managing the Delegate
ja: 委任先を管理する

source: Manipulating Index Ranges
ja: インデックス範囲を操作する

source: Manipulating Indexes
ja: インデックスを操作する

source: Mantissa
ja: 仮数

source: Many of the methods you use to load resources from a bundle automatically locate the appropriate starting directory and look for resources in known places.
ja: あなたがリソースをバンドルからロードするのに使うメソッドの多くは、自動的に適切な開始ディレクトリを突き止めて、いくつかの既知の場所でリソースを探します。

source: Many programming tasks involve sending data over a network connection, saving data to disk, or submitting data to APIs and services.
ja: 多くのプログラミング作業がネットワーク接続を越えてのデータの送信、ディスク上でのデータの保存、またはAPIおよびサービスへのデータの提出を伴います。

source: Marks beginning of the range of error codes reserved for errors related to executable files.
ja: 実行可能ファイルに関連するエラーのために予約されるエラーコードの範囲の始まりを印します。

source: Marks end of the range of error codes reserved for errors related to executable files.
ja: 実行可能ファイルと関係するエラーのために予約されるエラーコードの範囲の終わりを印します。

source: Marks the end of the range of error codes reserved for file errors.
ja: ファイルエラーのために予約済みのエラーコードの範囲の終わりを印します。

source: Marks the start of the range of error codes reserved for file errors.
ja: ファイルエラーのために予約済みのエラーコードの範囲の始まりを印します。

source: Match 0 or more times.
ja: ０以上の繰り返しにマッチします。

source: Match 1 or more times.
ja: １以上の繰り返しにマッチします。

source: Match a LINE FEED, \u000A.
ja: LINE FEED（\u000A）にマッチします。

source: Match a control-X character
ja: control-X文字にマッチします

source: Match a BACKSPACE, \u0008.
ja: バックスペース（\u0008）にマッチします。

source: Match a BELL, \u0007
ja: ひとつのBELL、\u0007にマッチします

source: Match a CARRIAGE RETURN, \u000D.
ja: キャリッジ・リターン（\u000D）にマッチします。

source: Match a FORM FEED, \u000C.
ja: FORM FEED（改ページ）、\u000Cにマッチします。

source: Match a Grapheme Cluster.
ja: Grapheme Cluster（書記素クラスタ）にマッチします。

source: Match a HORIZONTAL TABULATION, \u0009.
ja: HORIZONTAL TABULATION（水平タブ）、\u0009にマッチします。

source: Match a non-white space character.
ja: 空白でない文字にマッチします。

source: Match a non-word character.
ja: 非単語文字にマッチします。

source: Match a white space character.
ja: 空白文字にマッチします。

source: Match a word character.
ja: 単語文字にマッチします。

source: Match an ESCAPE, \u001B.
ja: ESCAPE、\u001Bにマッチします。

source: Match an Octal character.
ja: ８進数の文字にマッチします。

source: Match any character not having the specified Unicode Property.
ja: 指定された「Unicodeプロパティ」を持っていないどんな文字にでもマッチします。

source: Match any character that is not a decimal digit.
ja: 10進数でないどんな文字にでもマッチします。

source: Match any character with the Unicode General Category of Nd (Number, Decimal Digit.)
ja: Unicode一般カテゴリーのNd（数、10進数）であるどんな文字にでもにマッチします。

source: Match any character with the specified Unicode Property.
ja: 指定された「Unicodeプロパティ」を持つどんな文字でもマッチします。

source: Match any character.
ja: どんな文字にでもマッチします。

source: Match any one character from the pattern.
ja: パターンからの何らかの１つの文字にマッチします。

source: Match as few times as possible, but not less than n.
ja: 可能な限り少なくマッチします、しかしnより少なくではありません。

source: Match as few times as possible.
ja: できるだけ少しの回数にしかマッチしません。

source: Match as many times as possible when first encountered, do not retry with fewer even if overall match fails (Possessive Match).
ja: 最初に出くわした時にできるだけ多くの回数にマッチします、たとえマッチ全体的が失敗するとしても、より少なく持つように再び試みることをしません（欲張りマッチ）。

source: Match as many times as possible, but not more than m.
ja: 可能なかぎり多くの、しかしmより多くでない、回数にマッチします。

source: Match as many times as possible.
ja: できるだけ多くの回数をマッチします。

source: Match at least n times.
ja: 少なくともn回にマッチします。

source: Match at least n times, but no more than required for an overall pattern match.
ja: 少なくともn回にマッチします、しかしパターン・マッチ全体的のために要求されるより多くではありません。

source: Match at the beginning of a line.
ja: 行の初めにマッチします。

source: Match at the beginning of the input.
ja: 入力の初めにマッチ。

source: Match at the end of a line.
ja: 行の終わりにマッチします。

source: Match between n and m times.
ja: nとm回の間のマッチ。

source: Match exactly n times.
ja: 正確にn回にマッチします。

source: Match if the current position is a word boundary.
ja: 現在の位置が語境界であるならば、マッチします。

source: Match if the current position is at the end of input, but before the final line terminator, if one exists.
ja: 現在の位置が入力の終わりにあるならばマッチします、しかし、もしそれが存在するならば、最終行終止の前で。

source: Match if the current position is at the end of input.
ja: 現在の位置が入力の終わりにあるならばマッチします。

source: Match if the current position is at the end of the previous match.
ja: 現在の位置が前のマッチの終わりにあるならば、マッチします。

source: Match if the current position is not a word boundary.
ja: 現在の位置が単語境界でないならば、マッチします。

source: Match letters in the pattern independent of case.
ja: 大文字小文字と無関係にパターンの文字にマッチします。

source: Match the character with hex value hhhh.
ja: 16進値hhhhでの文字にマッチします。

source: Match the character with the hex value hhhh.
ja: 16進値hhhhをもつ文字にマッチします。

source: Match the character with the hex value hhhhhhhh.
ja: 16進値hhhhhhhhでの文字にマッチします。

source: Match the character with two digit hex value hh.
ja: ２桁16進値hhでの文字にマッチします。

source: Match the named character.
ja: 指定された文字にマッチします。

source: Match whatever the nth capturing group matched.
ja: 第n番目の捕らえているグループがマッチしたもの何にでもマッチします。

source: Match zero or one times.
ja: ０か１の繰り返しにマッチします。

source: Matches a regular expression.
ja: ある正規表現にマッチするもの。

source: Matrices with a determinant that is less than the smallest valid representation of a double value greater than zero are considered to be invalid for representing as an inverse.
ja: ゼロより大きいダブル値の最も小さい有効な表現より小さい行列式を持つマトリックスは、反転として表現するのに有効ではないとみなされます。

source: May also return true if a read must be attempted in order to determine the availability of bytes.
ja: またtrueを返すかもしれません、もしバイトの利用可能性を決定するために読み出しが試みられなければならないならば。

source: May be nil.
ja: nilかもしれません。

source: May be a directory, file, or symbolic link, depending on what is located at the URL.
ja: URLで位置を示されるものが何かに依存して、ディレクトリ、ファイル、またはシンボリックリンクかもしれません。

source: Measurements
ja: 寸法

source: Member hierarchy (recursive).
ja: メンバーの階層（再帰的）。

source: Memory Allocation Options
ja: メモリアロケーションオプション

source: Memory Management
ja: メモリ管理

source: Merge Data at Different Depths
ja: 異なる深さでのデータを１つにする

source: Methods to Override
ja: メソッドのオーバーライド

source: Microsoft Windows codepage 1250; equivalent to WinLatin2.
ja: Microsoft Windows コードページ 1250；WinLatin2 に等しい。

source: Microsoft Windows codepage 1251, encoding Cyrillic characters; equivalent to AdobeStandardCyrillic font encoding.
ja: Microsoft Windows コードページ 1251、キリル文字の符号化；AdobeStandardCyrillic フォント符号化に等しい。

source: Microsoft Windows codepage 1252; equivalent to WinLatin1.
ja: Microsoft Windows コードページ 1252；WinLatin1 に等しい。

source: Microsoft Windows codepage 1253, encoding Greek characters.
ja: Microsoft Windows コードページ 1253、ギリシャ文字の符号化。

source: Microsoft Windows codepage 1254, encoding Turkish characters.
ja: Microsoft Windows コードページ 1254、トルコ文字の符号化。

source: Modification date and access permissions.
ja: 修正日とアクセス権。

source: Modifies the given index to refer to the item after the one it currently refers to.
ja: 与えられたインデックスを、それが現在参照するものの後の項目を参照するように修正します。

source: Modifies the given index to refer to the item before the one it currently refers to.
ja: 与えられたインデックスを、それが現在参照するものの前の項目を参照するように修正します。

source: Most creation methods for File Handle cause the file handle object to take ownership of the associated file descriptor.
ja: File Handleに対する大部分の作成メソッドは、ファイルハンドルオブジェクトにその結びつけられたファイル記述子の所有権を取らせます。

source: Moves an item to the trash.
ja: 項目をゴミ箱に移動します。

source: Moves the file or directory at the specified URL to a new location synchronously.
ja: 指定されたURLでファイルやディレクトリを新しい場所に非同期に移動します。

source: Moves the file or directory at the specified path to a new location synchronously.
ja: 指定されたパスでファイルやディレクトリを新しい場所に非同期に移動します。

source: Moves the file pointer to the specified offset within the file represented by the receiver.
ja: ファイルポインタをレシーバによって表されるファイル内部の指定されたオフセットに移動します。

source: Moving an Item
ja: 項目を移動する

source: Moving and Copying Items
ja: 項目の移動とコピー

source: Multiple calls to this method from the same thread cause the corresponding selectors to be queued and performed in the same same order in which the calls were made, assuming the associated run loop modes for each selector are the same.
ja: このメソッドの同じスレッドからの複数の呼び出しは、該当しているセレクタがデキューされて、それらの呼び出しがされたのと同じ順序で実行されるようにします、それぞれのセレクタに関して実行ループモードが同じであると仮定します。

source: Multiple calls to this method from the same thread cause the corresponding selectors to be queued and performed in the same same order in which the calls were made.
ja: このメソッドの同じスレッドからの複数の呼び出しは、該当しているセレクタがデキューされて、それらの呼び出しがされたのと同じ順序で実行されるようにします。

source: Multiplies number by power of 10 and stores the product, possibly rounded off according to rounding Mode, in result.
ja: numberに10のpower乗を掛けます、そして可能ならrounding Modeにしたがって丸めて、resultに積を格納します。

source: Multiplies right Operand by left Operand and stores the product, possibly rounded off according to rounding Mode, in result.
ja: right Operandにleft Operandを掛けます、そして可能ならrounding Modeにしたがって丸めて、resultに差を格納します。

source: Multiplies a decimal by the specified power of 10.
ja: 指定された10の累乗を、ある10進数に掛けます。

source: Multiplies two decimal numbers together.
ja: ２つの10進数を互いに掛け合わせます。

source: Multiplies two decimal numbers, storing the result in the first number.
ja: ２つの10進数を掛け合わせます、結果を最初の数に格納します。

source: Multiplies two decimal numbers.
ja: ２つの10進数を掛け合わせます。

source: Must be either "0" or "1".
ja: "0" または "1" のどちらかでなければなりません。

source: Must not be nil.
ja: nilであってはいけません。

source: Must not be 0.
ja: 0であってはいけません。

source: Mutates an affine transformation by appending the specified matrix.
ja: 指定されたマトリックスを後に追加することによって、アフィン変換マトリックスを変化させます。

source: Mutates an affine transformation by prepending the specified matrix.
ja: 指定されたマトリックスを前に加えることによって、アフィン変換マトリックスを変化させます。

source: Mutates an affine transformation matrix from a rotation value (angle α in degrees).
ja: アフィン変換マトリックスを回転値（度数での角度α）から変化させます。

source: Mutates an affine transformation matrix from a rotation value (angle α in radians).
ja: アフィン変換マトリックスを回転値（ラジアンでの角度α）から変化させます。

source: Mutates an affine transformation matrix to perform a scaling in each of the x and y dimensions.
ja: アフィン変換マトリックスを変化させて、拡大縮小をxとy次元のそれぞれで実行します。

source: Mutates an affine transformation matrix to perform the given scaling in both x and y dimensions.
ja: アフィン変換マトリックスを変化させて、与えられた拡大縮小をxとy次元で実行します。

source: Mutates an affine transformation matrix to perform the given translation.
ja: アフィン変換マトリックスを変化させて、与えられた平行移動を実行します。

source: Mutates the raw bytes in the data's buffer.
ja: データの持つバッファの中の生のバイトを変化させます。

source: NSDimension subclass
ja: NSDimensionサブクラス

source: NSObject Script Support
ja: NSObjectスクリプトサポート

source: Name of the host to look up.
ja: 捜し出すホストの名前。

source: Name of the notification to post.
ja: 投函する通知の名前。

source: Name of the notification to remove from dispatch table.
ja: ディスパッチテーブルから除去する通知の名前。

source: Names
ja: さまざまな名前

source: Natural Language Processing
ja: 自然言語を処理する

source: Negates this decimal.
ja: この10進数を負にします。

source: Negative Look-behind assertion.
ja: 否定の後方指定。

source: Negative look-ahead assertion.
ja: 否定の前方指定。

source: Negative numbers are treated as positive numbers when creating the string.
ja: 負数は、文字列を作成する時に正数として扱われます。

source: Neither the object receiving this message, nor observer, are retained.
ja: このメッセージを受け取っているオブジェクトも、observerも、リテイン（保持）されません。

source: Network address to look up.
ja: 捜すネットワークアドレス。

source: Networking
ja: ネートワーク関連

source: No elements will be lost.
ja: 要素が失われることはありません。

source: No information for the date or time.
ja: 日付と時刻に対して情報なし。

source: No options are currently defined.
ja: オプションは現在は定義されません。

source: Non-capturing parentheses.
ja: 捕獲しない括弧。

source: Non-stand-alone properties are for use in context (for example, “Saturday, November 12th”).
ja: 非単独動作型のプロパティは、文脈において使われるためのものです（例えば、 “Saturday, November 12th”）。

source: None
ja: なし

source: Normalizes the internal format of two decimal numbers to simplify later operations.
ja: ２つの10進法数の内部形式を正規化して、後の演算を簡単にします。

source: Normally you should just accept the locale's default date for the switch.
ja: 通常あなたは切り替えに対してロケールの持つ省略時の日付だけを受け入れるべきです。

source: Not currently used by applications.
ja: 現在はアプリケーションによって使用されません。

source: Note
ja: 注意

source: Note that dispatching an event means routing an event to an appropriate handler in the current application.
ja: あるイベントを発送（ディスパッチ）することは、あるイベントを現在のアプリケーションの中の適切なハンドラへ定まった経路で送ることを意味するのに注意してください。

source: Note that a carriage-return / line-feed pair in text behave as a single line terminator, and will match a single "." in a regular expression pattern
ja: テキストの中のcarriage-return / line-feed 対が１つの行終止としてふるまって、正規表現パターンで単一の「.」にマッチすることに注意してください

source: Note that a given entire day within a calendar is not necessarily all in a weekend or not; weekends can start in the middle of a day in some calendars and locales.
ja: カレンダー内の与えられたある１日全体は、必ずしも週末の中に全てあるか否かではありません；週末は、いくつかのカレンダーとロケールにおいて１日の真ん中で始まることがあります。

source: Note that putting them together yourself via string concatenation may be incorrect for some locales.
ja: 文字列連結によってあなた自身でそれらを一緒にまとめることは、幾つかのロケールで正しくないかもしれないことに注意してください。

source: Note that repeating decimals or numbers with a mantissa larger than 38 digits cannot be represented precisely.
ja: 循環小数または38桁より大きな仮数を持つ数は、正確に表されることができないことに注意してください。

source: Note that this method does not cause a continuous stream of notifications to be sent.
ja: このメソッドは、通知の途切れないストリームが送られるようにすることに注意してください。

source: Note that this method does not continue to listen for connection requests after it posts NSFile Handle Connection Accepted.
ja: このメソッドは、接続要請に対して聞き耳をたてることを、それがNSFile Handle Connection Acceptedを投函する後では継続しないことに注意してください。

source: Note, therefore, that if the selector does not exist it is registered and the newly-registered selector is returned.
ja: したがって、セレクタが存在しないならば、それが登録され、そして新しく登録されたセレクタが返されることに注意してください。

source: Notification center type being inquired about.
ja: それについて尋ねられる通知センター型。

source: Notification posting behavior when notification delivery is suspended.
ja: 通知配達が待機させられる場合の通知投函挙動。

source: Notifications
ja: 通知

source: Notifying Observers of Changes
ja: 変更のオブザーバに通知する

source: Now that the shorter Indices array holds the indices of the shorter names in the names set, you can use those indices to access elements in the set.
ja: 現在、shorter Indices配列はnames集合の中の短い名前のインデックスを保持します、あなたはそれらのインデックスを使って集合の中の要素にアクセスできます。

source: Number of bytes copied into the destination buffer.
ja: 目的地バッファへとコピーされるバイト数。

source: Numbers
ja: さまざまな数

source: Numbers and Currency
ja: 数値と通貨

source: Numbers, Data, and Basic Values
ja: 数、データ、そして基本的な値

source: Object Allocation and Deallocation
ja: オブジェクトのアロケートとデアロケート

source: Object Matching Tests
ja: オブジェクトマッチングテスト

source: Object Runtime
ja: オブジェクトランタイム

source: Object Specifiers
ja: オブジェクト指定子

source: Object registering as an observer.
ja: オブザーバとして登録するオブジェクト。

source: Objects are considered identical if their object addresses are the same.
ja: オブジェクトは、それらのアドレスが同じならば同一とみなされます。

source: Objects in the resulting array appear in the same order as they do in the receiver.
ja: 結果である配列の中のオブジェクトは、それらがレシーバにおいてとるのと同じ順番で現れます。

source: Observer to remove from the dispatch table.
ja: ディスパッチテーブルから除去するオブザーバ。

source: Observers of to-many relationships are informed of the type of change made — as well as which objects are involved in the change.
ja: 対多関係の監視は、なされる変更の種類 — それだけでなくどのオブジェクトが変更に関わっているか、を通知されます。

source: Observing Customization
ja: カスタマイズを監視する

source: Obtaining Information About Methods
ja: メソッドについての情報の取得

source: Obtains a class by name.
ja: 名前によってあるクラスを取得します。

source: Obtains the actual size and the aligned size of an encoded type.
ja: エンコードされた型の実際のサイズとアラインされたサイズを獲得します。

source: Obtains the actual size and the aligned size of the first data type represented by type Ptr and returns a pointer to the position of the next data type in type Ptr.
ja: type Ptrによって表される最初のデータ型の実際のサイズとアラインされたサイズを獲得します、そしてtype Ptrの中の次のデータ型の位置へのポインタを返します。

source: Offsets the given index by the specified distance, or so that it equals the given limiting index.
ja: 与えられたインデックスを指定された間隔で補います、またはそれでそれは与えられた限界インデックスと等しくなります。

source: Offsets the given index by the specified distance.
ja: 与えられたインデックスを指定された間隔で補います。

source: Offsets the rectangle by the specified amount.
ja: 矩形を指定された量だけオフセットします。

source: Often the correct way to compare two objects for scripting is different from the correct way to compare objects programmatically.
ja: しばしばスクリプティングにとって２つのオブジェクトを比較する正しい方法は、プログラムコードによってオブジェクトを比較する正しい方法とは異なります。

source: Omit properties from the Coding Keys enumeration if they won't be present when decoding instances, or if certain properties shouldn't be included in an encoded representation.
ja: これらプロパティをCoding Keys列挙から省略してください、もしそれらがインスタンスをデコードする時に存在しないならば、または若干のプロパティがエンコード済み表現の中に含められるべきでないならば。

source: On This Page
ja: この項には

source: On both iOS and macOS, instances of NSText Checking Result are returned by the NSRegular Expression class and the NSData Detector class to indicate the discovery of content.
ja: iOSとmacOSの両方では、NSText Checking ResultのインスタンスはNSRegular ExpressionクラスとNSData Detectorクラスによって返されて、見つけ出された内容を指し示します。

source: On earlier versions of the operating system, or when using the legacy formatter behavior or running in 32-bit in macOS, NSDate Formatter is not thread safe, and you therefore must not mutate a date formatter simultaneously from multiple threads.
ja: オペレーティングの以前のバージョンでは、またはレガシーフォーマッタ挙動を使うまたは32-bitをmacOSで実行する場合、NSDate Formatterはスレッド安全ではありません、そしてあなたはそのゆえに複数のスレッドから同時に日付フォーマッタを変更してはいけません。

source: On iOS 7 and later NSDate Formatter is thread safe.
ja: iOS 7以降ではNSDate Formatterはスレッド安全です。

source: On iOS and in a flipped coordinate system in macOS desktop—where the origin is at the top left—the rectangle edge closest to the bottom of the screen is the “lower” edge (and is considered outside the rectangle).
ja: iOS上でそしてmacOSデスクトップでの反転座標システムにおいて — そこにおいて原点は上側左です — 画面の下に最も近い矩形の端は、「下」端です（そして矩形外と考えられます）。

source: On input, a pointer for a URL object.
ja: 入力では、URLオブジェクトに対するポインタ。

source: On input, a pointer to a URL object.
ja: 入力では、URLオブジェクトに対するポインタ。

source: On input, a pointer to a variable for a date object.
ja: 入力では、ある日付オブジェクトに対する変数へのポインタ。

source: On input, a pointer to an error object variable.
ja: 出力に関して、ポインタはあるエラーオブジェクト変数です。

source: On output, this parameter contains the date after which the item is no longer available at the returned URL.
ja: 出力では、このパラメータは、その後では項目がもはや返されるURLで利用可能でない日付を含みます。

source: On output, this pointer is set to the item’s location in the trash.
ja: 出力では、このポインタはゴミ箱での項目の位置に設定されます。

source: On output, this variable may contain an error object indicating why the bundle’s executable could not be loaded.
ja: 出力に関して、この変数は、なぜバンドルの持つ実行可能ファイルがロードされなかったかを指し示しているエラーオブジェクトを含むかもしれません。

source: On return, if an error occurs, a pointer to an error information dictionary.
ja: オンで、エラーが起こるならば、エラー情報辞書へのポインタを返します。

source: Once deleted, the item is gone forever.
ja: 一旦削除したならば、項目は永遠に失われます。
